controllers/EmployeController.php

    public function actionEmployeOne($id)
    {
        $user = Yii::$app->user->identity;
        $employe = Employe::find()->where(['user_id'=>$id])->all();
---
SELECT * FROM `employe` WHERE `user_id`='10'