controllers/SiteController.php

    public function actionIndex()
    {
        $user = Yii::$app->user->identity;
        $employes = Employe::find()
            ->orderBy([
                'created' => SORT_DESC
            ])->all();
---
SELECT * FROM `employe` ORDER BY `created` DESC