models/Employe.php

SELECT * FROM `employe_status` WHERE `id`=1
---
    public function getStatus()
    {
        $model = EmployeStatus::findOne($this->employe_status_id);