models/User.php

SELECT * FROM `user` WHERE `id`=2
---
    public static function findIdentity($id)
    {
        return self::findOne($id);

SELECT * FROM `user` WHERE (`email`='xoliqovhamid@gmail.com') AND (`status`=1)
---
    public static function findByEmail($email)
    {
       return self::findOne(['email' => $email, 'status' => self::ACTIVE_USER]);